//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {
      //  Задача 1
       // Необходимо присвоить переменным разные значения. Для решения этой задачи используйте тип переменной var
        var dog = 8.0;
        var cat = 3.6;
        var paper = 763_789;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);

        //Задача 2
        //Увеличьте значение каждой перечисленной в прошлой задаче переменной на 4.
        //Выведите в консоль новые значения переменных.
        dog = dog + 4;
        cat = cat +4;
        paper = paper +4;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);

        //Задача 3
        //Теперь нужно уменьшить значение каждой переменной:
        // dog уменьшить на 3.5;
        // cat уменьшить на 1.6;
        // paper уменьшить на 7_639.
        //Выведите в консоль новые значения переменных. Для решения этой задачи используйте тип переменной var.
        var minusDog = dog -3.5;
        var minusCat = cat - 1.6;
        var minusPaper = paper - 7_639;
        System.out.println(minusDog);
        System.out.println(minusCat);
        System.out.println(minusPaper);

        //Задача 4
        //Инициализируйте (присвойте значение) переменную friend значением 19.
        //Увеличьте значение переменной на 2, после чего поделите значение на 7.
        //После каждой операции выводите значение переменной в консоль. В итоге у вас должно быть выведено 3 значения одной переменной.
        //Для решения этой задачи используйте тип переменной var.
        var friend = 19;
        System.out.println(friend);
        friend = friend +2;
        System.out.println(friend);
        friend = friend /7;
        System.out.println(friend);

        //Задача 5
        //Инициализируйте переменную frog значением 3.5.
        //Увеличьте переменную в 10 раз и поделите на 3.5. Добавьте к последнему значению переменной 4.
        //После каждой операции выводите значение переменной в консоль. В итоге у вас должно быть выведено 4 значения одной переменной.
        //Для решения этой задачи используйте тип переменной var.
        var frog =3.5;
        System.out.println(frog);
        frog = frog *10;
        System.out.println(frog);
        frog = frog /3.5;
        System.out.println(frog);
        frog = frog +4;
        System.out.println(frog);

        //Задача 6
        //В боксе перед каждым боем спортсменов взвешивают. Это делают для того, чтобы убедиться, что боксеры соответствуют своей весовой категории и бой будет честным.
        //Масса одного боксера — 78.2 кг.
        //Масса второго боксера — 82.7 кг.
        //Подсчитайте и выведите в консоль общую массу двух бойцов.
        //Подсчитайте и выведите в консоль разницу между массами бойцов.
        // Для решения этой задачи используйте тип переменной var.

        var boxer1 = 78.2;
        var boxer2 = 82.7;
        var summBoxers = boxer1 + boxer2;
        System.out.println(summBoxers + "кг");
        var diffBoxers = boxer2 - boxer1;
        System.out.println(diffBoxers + "кг");

        //Задача 7??
        //Найдите остаток от деления между двумя весами.
        //Для решения этой задачи используйте тип переменной var.
        var remainBoxers = boxer2 %boxer1;
        System.out.println(remainBoxers);

        //Задача 8
        //Решите задачу с помощью арифметических функций.
        // 640 часов работы поделено между сотрудниками.
        // Если каждый сотрудник посвящает работе 8 часов, то сколько всего работников в компании?
        // Выведите результат задачи в консоль в формате: «Всего работников в компании — … человек».
        // ??Посчитайте, сколько часов работы должно быть поделено между сотрудниками, если в компании работает на 94 человека больше.
        // Выведите результат задачи в консоль в формате: «Если в компании работает … человек, то всего … часов работы может быть поделено между сотрудниками».
        //Для решения этой задачи используйте тип переменной var.

        var teamWork = 640;
        var singleWork = 8;
        var worker = teamWork / singleWork;
        System.out.println("Всего работников в компании — " + worker + " человек");
        worker = worker + 94;
        singleWork = teamWork/ worker;
        System.out.println("Если в компании  " + worker + " человек, то всего " + singleWork + " часов работы может быть поделено между сотрудниками");

        }
    }